tap "hashicorp/tap"
tap "ngrok/ngrok"
tap "withgraphite/tap"
brew "bat"
brew "cloud-sql-proxy"
brew "duf"
brew "ffmpeg"
brew "gh"
brew "go"
brew "imagemagick"
brew "ncdu"
brew "nvm"
brew "ollama"
brew "pipx"
brew "postgresql@14"
brew "postgresql@16"
brew "postgresql@17"
brew "powerlevel10k"
brew "tldr"
brew "tree"
brew "vercel-cli"
brew "watchman"
brew "yarn"
brew "hashicorp/tap/terraform"
cask "1password"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "google-chrome"
cask "gstreamer-runtime"
cask "linear-linear"
cask "localxpose"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "microsoft-word"
cask "ngrok"
cask "notion"
cask "orbstack"
cask "postman"
cask "slack"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
cask "wine-stable"
vscode "4ops.terraform"
vscode "akamud.vscode-theme-onedark"
vscode "azemoh.one-monokai"
vscode "bierner.emojisense"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmewburn.vscode-intelephense-client"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "canadaduane.notes"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dionmunk.vscode-notes"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eddyvinck.internetstorm"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "idleberg.icon-fonts"
vscode "jamesummex.optimized-dracula-theme"
vscode "janisdd.vscode-edit-csv"
vscode "k--kato.intellij-idea-keybindings"
vscode "mattpocock.ts-error-translator"
vscode "miguelsolorio.fluent-icons"
vscode "mquandalle.graphql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.theme-markdownkit"
vscode "ms-vscode.theme-predawnkit"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "rexebin.dracula-black"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sirtori.indenticator"
vscode "supermaven.supermaven"
vscode "techer.open-in-browser"
vscode "trinm1709.dracula-theme-from-intellij"
vscode "valentjn.vscode-ltex"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "wraith13.unsaved-files-vscode"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
go "github.com/air-verse/air"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
